Revit 2027 API
MacroManager.IsEnabled Property
 Indicates if macros stored in this MacroManager are enabled.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEnabled { get; }
Public ReadOnly Property IsEnabled As Boolean
	Get
public:
property bool IsEnabled {
	bool get ();
}
member IsEnabled : bool with get
Property Value
Boolean
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace